Ran Plan for 3 projects:

1. project: `apps-prod` dir: `4.apps` workspace: `prod`
1. project: `apps-staging` dir: `4.apps` workspace: `staging`
1. project: `platform` dir: `2.platform` workspace: `default`

### 1. project: `apps-prod` dir: `4.apps` workspace: `prod`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:4f58ff4 

Backend config changed or missing. Reinitializing...


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # kubectl_manifest.kubero_operator[45] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding"
        name                    = "kubero-operator-manager-rolebinding"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[46] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding"
        name                    = "kubero-operator-proxy-rolebinding"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubernetes_service_account.kubero will be updated in-place
~ resource "kubernetes_service_account" "kubero" {
        id                              = "kubero-prod/kubero"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              - "app.kubernetes.io/instance"   = "kubero" -> null
              - "app.kubernetes.io/managed-by" = "Helm" -> null
              - "app.kubernetes.io/name"       = "kubero" -> null
              - "app.kubernetes.io/version"    = "v3" -> null
              - "helm.sh/chart"                = "kubero-0.1.0" -> null
            }
            name             = "kubero"
            # (5 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p apps-prod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F4.apps%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p apps-prod`
</details>
Plan: 0 to add, 3 to change, 0 to destroy.

---
### 2. project: `apps-staging` dir: `4.apps` workspace: `staging`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:4f58ff4 

Backend config changed or missing. Reinitializing...


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # kubernetes_service_account.kubero will be updated in-place
~ resource "kubernetes_service_account" "kubero" {
        id                              = "kubero-staging/kubero"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              - "app.kubernetes.io/instance"   = "kubero" -> null
              - "app.kubernetes.io/managed-by" = "Helm" -> null
              - "app.kubernetes.io/name"       = "kubero" -> null
              - "app.kubernetes.io/version"    = "v3" -> null
              - "helm.sh/chart"                = "kubero-0.1.0" -> null
            }
            name             = "kubero"
            # (5 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p apps-staging`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F4.apps%252Fstaging)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p apps-staging`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 3. project: `platform` dir: `2.platform` workspace: `default`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:4f58ff4 

Backend config changed or missing. Reinitializing...


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.http.casdoor_oidc_discovery[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "casdoor_oidc_discovery" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + request_headers      = {
          + "Accept" = "application/json"
        }
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://sso.zitian.party/.well-known/openid-configuration"
    }

  # restapi_object.app_dashboard_oidc[0] will be created
+ resource "restapi_object" "app_dashboard_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/delete-application?id=admin/{id}"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/add-application"
      + read_path       = "/get-application?id=admin/{id}"
      + update_path     = "/update-application"
    }

  # restapi_object.app_kubero_oidc[0] will be created
+ resource "restapi_object" "app_kubero_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/delete-application?id=admin/{id}"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/add-application"
      + read_path       = "/get-application?id=admin/{id}"
      + update_path     = "/update-application"
    }

  # restapi_object.app_portal_gate[0] will be created
+ resource "restapi_object" "app_portal_gate" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/delete-application?id=admin/{id}"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/add-application"
      + read_path       = "/get-application?id=admin/{id}"
      + update_path     = "/update-application"
    }

  # restapi_object.app_vault_oidc[0] will be created
+ resource "restapi_object" "app_vault_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/delete-application?id=admin/{id}"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/add-application"
      + read_path       = "/get-application?id=admin/{id}"
      + update_path     = "/update-application"
    }

  # restapi_object.provider_github[0] will be updated in-place
~ resource "restapi_object" "provider_github" {
      + create_path  = "/add-provider"
      ~ data         = (sensitive value)
      - debug        = true -> null
      + destroy_path = "/delete-provider?id=admin/{id}"
        id           = "GitHub"
      + id_attribute = "name"
      ~ path         = "/get-provider?id=admin" -> "/add-provider"
      + read_path    = "/get-provider?id=admin/{id}"
      + update_path  = "/update-provider"
        # (2 unchanged attributes hidden)
    }

  # vault_jwt_auth_backend.oidc[0] will be created
+ resource "vault_jwt_auth_backend" "oidc" {
      + accessor           = (known after apply)
      + default_role       = "reader"
      + description        = "OIDC backend for Casdoor"
      + disable_remount    = false
      + id                 = (known after apply)
      + local              = false
      + namespace_in_state = true
      + oidc_client_id     = "vault-oidc"
      + oidc_client_secret = (sensitive value)
      + oidc_discovery_url = "https://sso.zitian.party"
      + path               = "oidc"
      + tune               = [
          + {
              + allowed_response_headers     = []
              + audit_non_hmac_request_keys  = []
              + audit_non_hmac_response_keys = []
              + default_lease_ttl            = "1h"
              + listing_visibility           = ""
              + max_lease_ttl                = "8h"
              + passthrough_request_headers  = []
              + token_type                   = "default-service"
            },
        ]
      + type               = "oidc"
    }

  # vault_jwt_auth_backend_role.reader[0] will be created
+ resource "vault_jwt_auth_backend_role" "reader" {
      + allowed_redirect_uris        = [
          + "http://localhost:8250/oidc/callback",
          + "https://secrets.zitian.party/ui/vault/auth/oidc/oidc/callback",
        ]
      + backend                      = "oidc"
      + bound_audiences              = [
          + "vault-oidc",
        ]
      + bound_claims_type            = (known after apply)
      + clock_skew_leeway            = 0
      + disable_bound_claims_parsing = false
      + expiration_leeway            = 0
      + id                           = (known after apply)
      + not_before_leeway            = 0
      + oidc_scopes                  = [
          + "email",
          + "openid",
          + "profile",
        ]
      + role_name                    = "reader"
      + role_type                    = "oidc"
      + token_policies               = [
          + "reader",
        ]
      + token_ttl                    = 3600
      + token_type                   = "default"
      + user_claim                   = "sub"
      + user_claim_json_pointer      = false
      + verbose_oidc_logging         = true
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Changes to Outputs:
~ sso_e2e_status                 = {
      ~ oidc_discovery = "disabled" -> (known after apply)
      ~ portal_auth    = "disabled" -> "200"
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 6 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`